app/controllers/api/photos_controller.rb

    def create
        @photo = Photo.new(photo_params)
        @photo.user_id = current_user.id
        if @photo.save
---
INSERT INTO "photos" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["description", "this is a test"], ["user_id", 21], ["created_at", "2021-02-11 18:38:18.962452"], ["updated_at", "2021-02-11 18:38:18.962452"]]

    def update
        @photo = Photo.find_by(id: params[:id])
        if @photo.update(photo_params)
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
UPDATE "photos" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "photos"."id" = $4  [["title", "silver player"], ["description", "get me out of silver"], ["updated_at", "2021-02-11 19:28:34.632743"], ["id", 8]]

    def destroy
        photo = Photo.find_by(id: params[:id])
        photoId = {photoId: photo.id}
        photo.delete
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 2]]

    def show
        @photo = Photo.find_by(id: params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]