app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "demo_user"], ["LIMIT", 1]]
---
    def demo_user
        @user = User.find_by(username: 'demo_user')